INSERT INTO user (user_name) VALUES
                 ('1'), ('2'), ('3'), ('4'), ('5'), ('6'), ('7'),
                 ('8'), ('9'), ('10'), ('11'), ('12'), ('13'), ('14'),
                 ('15'), ('16'), ('17'), ('18'), ('19'), ('20'), ('21'),
                 ('22'), ('23'), ('24'), ('25'), ('26'), ('27'), ('28'),
                 ('29'), ('30'), ('31'), ('32'), ('33'), ('34'), ('35'),
                 ('36'), ('37'), ('38'), ('39'), ('40');


INSERT INTO lecture (lecture_name, lecturer) VALUES
    ('로이코치님과 함께하는 백엔드 강의', '로이'), ('렌코치님과 함께하는 백엔드 강의', '렌'),
    ('탸일러코치님과 함께하는 백엔드 강의', '탸일러'), ('토투코치님과 함께하는 백엔드 강의', '토투'),
    ('김종협코치님과 함께하는 백엔드 강의', '김종협'), ('허재코치님과 함께하는 백엔드 강의', '허재'),
    ('하현우코치님과 함께하는 백엔드 강의', '렌'), ('이석범코치님과 함께하는 백엔드 강의', '이석범');


INSERT INTO lecture_item (available_date, lecture_id, available_cnt) VALUES
     ('2024-10-04', 1, 30),
     ('2024-10-06', 2, 30),
     ('2024-10-03', 3, 0),
     ('2024-10-10', 4, 30),
     ('2024-10-12', 5, 30),
     ('2024-11-13', 6, 30),
     ('2024-11-05', 7, 30),
     ('2024-11-10', 8, 30);